#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/anna_tf_test/anna-ck-gh-new/runs/run-iKLu1Gb8wvR9PhdM

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...
aws_vpc.main: Refreshing state... [id=vpc-08e988ece43938743]
aws_subnet.public_subnet_1: Refreshing state... [id=subnet-06b78b0c589ee8f7c]
aws_subnet.public_subnet_2: Refreshing state... [id=subnet-00a1553eff8f8aa73]
aws_subnet.private_subnet_2: Refreshing state... [id=subnet-0f25f3e137c31fa0a]
aws_route_table_association.public_subnet_1: Refreshing state... [id=rtbassoc-06e09df73ad7b3078]
aws_route_table_association.public_subnet_2: Refreshing state... [id=rtbassoc-0f9ec6e7f40931e34]
aws_subnet.private_subnet_1: Refreshing state... [id=subnet-0e051df1ad2d3b105]
aws_internet_gateway.main: Refreshing state... [id=igw-0103ba071e0abde7d]
aws_security_group.lb_security_group: Refreshing state... [id=sg-0969d4459569a32a2]
aws_lb_target_group.example: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:891377344017:targetgroup/example-tg/887d187581189ff5]
aws_route_table.public: Refreshing state... [id=rtb-0c6a6bc63543a9d54]
aws_security_group.ec2_allow_lb: Refreshing state... [id=sg-03942ddba36ba36e4]
aws_lb.example: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:891377344017:loadbalancer/app/example-alb/e6b11e951bcfa6ae]
aws_lb_listener.example: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:891377344017:listener/app/example-alb/e6b11e951bcfa6ae/7ede47959c44ae91]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_instance.example will be created
  + resource "aws_instance" "example" {
      + ami                                  = "ami-0b4a21432a0c9c1ab"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "ExampleEC2Instance"
        }
      + tags_all                             = {
          + "Name" = "ExampleEC2Instance"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "0cb5712a95d923e2b7015e6cea98fb02cccb1fc6"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-03942ddba36ba36e4",
        ]

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_lb.example will be updated in-place
  ~ resource "aws_lb" "example" {
        id                                                           = "arn:aws:elasticloadbalancing:us-west-2:891377344017:loadbalancer/app/example-alb/e6b11e951bcfa6ae"
        name                                                         = "example-alb"
      ~ subnets                                                      = [
          - "subnet-00a1553eff8f8aa73",
          - "subnet-06b78b0c589ee8f7c",
        ] -> (known after apply)
        tags                                                         = {
            "Name" = "example-alb"
        }
        # (24 unchanged attributes hidden)

      ~ subnet_mapping (known after apply)
      - subnet_mapping {
          - subnet_id            = "subnet-00a1553eff8f8aa73" -> null
            # (4 unchanged attributes hidden)
        }
      - subnet_mapping {
          - subnet_id            = "subnet-06b78b0c589ee8f7c" -> null
            # (4 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_route_table_association.public_subnet will be created
  + resource "aws_route_table_association" "public_subnet" {
      + id             = (known after apply)
      + route_table_id = "rtb-0c6a6bc63543a9d54"
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_subnet_1 will be destroyed
  # (because aws_route_table_association.public_subnet_1 is not in configuration)
  - resource "aws_route_table_association" "public_subnet_1" {
      - id             = "rtbassoc-06e09df73ad7b3078" -> null
      - route_table_id = "rtb-0c6a6bc63543a9d54" -> null
      - subnet_id      = "subnet-06b78b0c589ee8f7c" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_route_table_association.public_subnet_2 will be destroyed
  # (because aws_route_table_association.public_subnet_2 is not in configuration)
  - resource "aws_route_table_association" "public_subnet_2" {
      - id             = "rtbassoc-0f9ec6e7f40931e34" -> null
      - route_table_id = "rtb-0c6a6bc63543a9d54" -> null
      - subnet_id      = "subnet-00a1553eff8f8aa73" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_subnet.private_subnet will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "PrivateSubnet"
        }
      + tags_all                                       = {
          + "Name" = "PrivateSubnet"
        }
      + vpc_id                                         = "vpc-08e988ece43938743"
    }

  # aws_subnet.private_subnet_1 will be destroyed
  # (because aws_subnet.private_subnet_1 is not in configuration)
  - resource "aws_subnet" "private_subnet_1" {
      - arn                                            = "arn:aws:ec2:us-west-2:891377344017:subnet/subnet-0e051df1ad2d3b105" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-2a" -> null
      - availability_zone_id                           = "usw2-az1" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0e051df1ad2d3b105" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "891377344017" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "PrivateSubnet1"
        } -> null
      - tags_all                                       = {
          - "Name" = "PrivateSubnet1"
        } -> null
      - vpc_id                                         = "vpc-08e988ece43938743" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_subnet.private_subnet_2 will be destroyed
  # (because aws_subnet.private_subnet_2 is not in configuration)
  - resource "aws_subnet" "private_subnet_2" {
      - arn                                            = "arn:aws:ec2:us-west-2:891377344017:subnet/subnet-0f25f3e137c31fa0a" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-2b" -> null
      - availability_zone_id                           = "usw2-az2" -> null
      - cidr_block                                     = "10.0.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0f25f3e137c31fa0a" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "891377344017" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "PrivateSubnet2"
        } -> null
      - tags_all                                       = {
          - "Name" = "PrivateSubnet2"
        } -> null
      - vpc_id                                         = "vpc-08e988ece43938743" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_subnet.public_subnet will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "PublicSubnet"
        }
      + tags_all                                       = {
          + "Name" = "PublicSubnet"
        }
      + vpc_id                                         = "vpc-08e988ece43938743"
    }

  # aws_subnet.public_subnet_1 will be destroyed
  # (because aws_subnet.public_subnet_1 is not in configuration)
  - resource "aws_subnet" "public_subnet_1" {
      - arn                                            = "arn:aws:ec2:us-west-2:891377344017:subnet/subnet-06b78b0c589ee8f7c" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-2a" -> null
      - availability_zone_id                           = "usw2-az1" -> null
      - cidr_block                                     = "10.0.3.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-06b78b0c589ee8f7c" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "891377344017" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "PublicSubnet1"
        } -> null
      - tags_all                                       = {
          - "Name" = "PublicSubnet1"
        } -> null
      - vpc_id                                         = "vpc-08e988ece43938743" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_subnet.public_subnet_2 will be destroyed
  # (because aws_subnet.public_subnet_2 is not in configuration)
  - resource "aws_subnet" "public_subnet_2" {
      - arn                                            = "arn:aws:ec2:us-west-2:891377344017:subnet/subnet-00a1553eff8f8aa73" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-2b" -> null
      - availability_zone_id                           = "usw2-az2" -> null
      - cidr_block                                     = "10.0.4.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-00a1553eff8f8aa73" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "891377344017" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "PublicSubnet2"
        } -> null
      - tags_all                                       = {
          - "Name" = "PublicSubnet2"
        } -> null
      - vpc_id                                         = "vpc-08e988ece43938743" -> null
        # (4 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 6 to destroy.

Changes to Outputs:
  + ec2_public_ip     = (known after apply)
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-iKLu1Gb8wvR9PhdM/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-iKLu1Gb8wvR9PhdM/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pushed by: @anna-ck, Action: `pull_request`*